app/controllers/items_controller.rb

SELECT `items`.* FROM `items` WHERE (place LIKE '%%' or region LIKE '%%')  ORDER BY created_at DESC
---
def index
  @items = Item.all

SELECT `items`.* FROM `items` WHERE (place LIKE '%edificio%' or region LIKE '%edificio%')  ORDER BY created_at DESC
---
def search
  @items = Item.all

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`item_id` = 2  ORDER BY created_at DESC
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`item_id` = ?  [["item_id", 1]]
UPDATE `items` SET `promedio` = ?, `updated_at` = ? WHERE `items`.`id` = ?  [["promedio", 0.0], ["updated_at", "2016-10-05 16:31:04"], ["id", 1]]
---
  def show
   @review = Review.where(item_id: @item.id).order("created_at DESC")
    if @item.reviews.blank?
      @avg_review = 0
    else
      @avg_review = @review.average(:rating).round(2)
    end
    @item.update_attribute(:promedio, @avg_review)

INSERT INTO `items` (`Place`, `description`, `region`, `environment`, `activities`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `direccion`, `created_at`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE `items` SET `image_file_name` = 'Museo_naval.jpg', `image_content_type` = 'image/jpeg', `image_file_size` = 102652, `image_updated_at` = '2016-10-06 02:31:30', `updated_at` = '2016-10-06 02:31:30' WHERE `items`.`id` = 2
---
  def update
    respond_to do |format|
      if @item.update(item_params)

SELECT  `items`.* FROM `items` WHERE `items`.`id` = ? LIMIT 1  [["id", 1]]
---
    def set_item
      @item = Item.find(params[:id])